{
  "name": "Kth Node From End Of Linked List",
  "slug": "linked-lists-kth-node-from-end-of-linked-list",
  "description": "1. You are given a partially written LinkedList class.\n2. Here is a list of existing functions:\n     2.1 addLast - adds a new element with given value to the end of Linked List\n     2.2. display - Prints the elements of linked list from front to end in a single line. \n     All elements are separated by space.\n    2.3. size - Returns the number of elements in the linked list.\n    2.4. removeFirst - Removes the first element from Linked List. \n    2.5. getFirst - Returns the data of first element. \n    2.6. getLast - Returns the data of last element. \n    2.7. getAt - Returns the data of element available at the index passed. \n    2.8. addFirst - adds a new element with given value in front of linked list.\n    2.9. addAt - adds a new element at a given index.\n    2.10. removeLast - removes the last element of linked list.\n    2.11. removeAt - remove an element at a given index\n3. You are required to complete the body of kthFromLast function. The function should be an iterative function and should return the kth node from end of linked list. Also, make sure to not use size data member directly or indirectly (by calculating size via making a traversal). k is a 0-based index. Assume that valid values of k will be passed.\n4. Input and Output is managed for you.\nInput Format\nInput is managed for you\nOutput Format\nOutput is managed for you\nQuestion Video\nCOMMENT\nConstraints\n1. Size property should not be used directly or indirectly\n2. Constant time, single traversal is expected\n3. Iterative solution, (not recursion) is expected\nSample Input\naddLast 10\ngetFirst\naddLast 20\naddLast 30\ngetFirst\ngetLast\ngetAt 1\naddLast 40\nkthFromEnd 3\ngetLast\naddLast 50\nremoveFirst\ngetFirst\nremoveFirst\nremoveFirst\nkthFromEnd 0\nremoveFirst\nremoveFirst\ngetFirst\nquit\n\nSample Output\n10\n10\n30\n20\n10\n40\n20\n50\nList is empty\n\n\n\nEditorial\nAsked in Companies\nRelated Topics\n\n\nDo you need more personalize experience while solving question along with doubt support.\n\nBUY NOW\n\n\n\n\n\n\n\n",
  "externalPlatforms": [],
  "problemVideoLink": "https://www.youtube.com/embed/cEJoiG9Gn_k?rel=0",
  "solutionVideolink": ""
}