{
  "name": "The State Of Wakanda - 2",
  "slug": "2d-arrays-the-state-of-wakanda-2",
  "description": "The historic state of Wakanda has various monuments and souveniers which are visited by many travellers every day. The guides follow a prescribed route of visiting the monuments which improves them understand the relevance of each monument. The route of the monument is fixed and expressed in a 2-d matrix where the travellers visit the prescribed next monument. For example\n1  2  3\n4  5  6\n7  8  9\nis the prescribed route and the visitors travels this path: 1->2->3->4->5->6->7->8->9\nHowever, a certain visitor decides to travel a different path as follows:\n1. The visitor only plans to visit the upper diagonal triangle of the monument list.\n2. The visitor travels diagonally till there are no more moves left in the current journey. \n3. He then visits the adjacent monument to the first monument of current diagonal journey. \n4. He continues the same path till all the monuments of the upper half have been travelled.\nFor Example:\nThe monuments are named as:\n1    2    3    4\n5    6    7    8\n9   10  11  12\n13 14  15  16\nThe path followed by the visitor is: 1->6->11->16->2->7->12->3->8->4\nYou are required to print the path followed by the traveller to visit all the monuments.\nRefer to the photo for a better clarification.\n1. You are given a number n, representing the number of rows and columns of a square matrix.\n2. You are given n * n numbers, representing elements of 2d array a.\n3. You are required to diagonally traverse the upper half of the matrix and print the contents.\nFor details check image.\n\n### Input Format\n```\nA number n\ne11\ne12..\ne21\ne22..\n.. n * n number of elements of array a\n```\n\n### Output Format\n```\nDiagonal traversal as in image below\n```\n\n### Constraints\n```\n1 <= n <= 10^2\n-10^9 <= e11, e12, .. n * m elements <= 10^9\n```\n\n### Sample Input\n```\n4\n11\n12\n13\n14\n21\n22\n23\n24\n31\n32\n33\n34\n41\n42\n43\n44\n```\n\n### Sample Output\n```\n11\n22\n33\n44\n12\n23\n34\n13\n24\n14\n```",
  "externalPlatforms": [],
  "problemVideoLink": "https://www.youtube.com/embed/rydBe9U-RtY?rel=0",
  "solutionVideolink": "https://www.youtube.com/embed/lvRdFCMD_Ew?rel=0&loop=1&playlist=lvRdFCMD_Ew",
  "codes": {
    "java": "import java.io.*;\nimport java.util.*;\npublic class Main {\n    public static void main(String[] args) throws Exception {\n        // write your code here\n    }\n}"
  }
}